Tekla Open API Reference for Tekla Structures 2025
Phase.PhaseNumber Property
 The phase number.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int PhaseNumber { get; set; }
Public Property PhaseNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace